In [2]:
import pandas as pd

In [4]:
employee = pd.read_table("data_sources/data_table.tsv")
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [6]:
cols = ["Name", "Position"]
employee = pd.read_table("data_sources/data_table.tsv")
employee[cols].head()

             Name                       Position
0      Airi Satou                     Accountant
1  Angelica Ramos  Chief Executive Officer (CEO)
2      Ashton Cox        Junior Technical Author
3   Bradley Greer              Software Engineer
4  Brenden Wagner              Software Engineer

In [8]:
employee = pd.read_table("data_sources/data_table.tsv", nrows=4)
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"

In [9]:
employee = pd.read_table("data_sources/data_table.tsv")
employee.dtypes

Name          object
Position      object
Office        object
Age            int64
Start date    object
Salary        object
dtype: object

In [12]:
import numpy as np
employee = pd.read_table("data_sources/data_table.tsv")
employee.select_dtypes(include  = [np.number]).dtypes

Age    int64
dtype: object

In [13]:
employee.describe()

             Age
count  57.000000
mean   42.736842
std    14.877507
min    19.000000
25%    30.000000
50%    42.000000
75%    56.000000
max    66.000000